{"pageProps":{"post":{"mdxSource":{"compiledSource":"\"use strict\";\n\nvar _excluded = [\"components\"];\n\nfunction _extends() { _extends = Object.assign || function (target) { for (var i = 1; i < arguments.length; i++) { var source = arguments[i]; for (var key in source) { if (Object.prototype.hasOwnProperty.call(source, key)) { target[key] = source[key]; } } } return target; }; return _extends.apply(this, arguments); }\n\nfunction _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\n\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n\n/* @jsxRuntime classic */\n\n/* @jsx mdx */\nvar layoutProps = {};\nvar MDXLayout = \"wrapper\";\n\nfunction MDXContent(_ref) {\n  var components = _ref.components,\n      props = _objectWithoutProperties(_ref, _excluded);\n\n  return mdx(MDXLayout, _extends({}, layoutProps, props, {\n    components: components,\n    mdxType: \"MDXLayout\"\n  }), mdx(\"p\", null, \"So, the idea for this is an \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://voxiitk.com/tag/awl/\"\n  }, \"AWL\"), \"; why not put in in Vox? I don't know, too bland there. Anyways, reflecting back on whatever time I had at IITK (yeah, excluding the online bit), was pretty crazy, the person who entered this college never thought to be the one leaving now. I will try to broadly describe things you could look forward to here, in a decreasing order of priorities and give my take at those.\"), mdx(\"p\", null, \"First, IITK has an insanely amazing bunch of people, make sure you find your crowd. Also, CS does this thing with wings, you don't really need to stich to them ngl, the day you feel that your parent wing is a bit normie, leave, you'll eventually find pepple who you feel are fun to be with (speaking from experience, just don't let a past wingie lurk around all the time). No set of rules or instructions though, on whom to hang out with and whom to stay away from, have fun with whatever you like, I feel I should not have a say on that for you. Socialize, don't socialize, do whatever you want, just don't be alone, I mean, serious skill issue if you cannot find 1 person to bond with in a bunch of 1200 (probably more). Cannot emphazise how important this will be to help you figure out who you want to be. Big time, you are the average the five people you hang out with banger.\"), mdx(\"p\", null, \"Moving on, academics. Yeah I think it helps a lot if you have a decent academic record. I think anybody would prefer seeing a CPI of 8.4 instead of the reverse on their transcripts. Although I never really understood the things specific to departments and whatever they teach in there, but that's a different issue. Talking specifically for Economics I mean the course contents are good, like actually useful, but the way they're taught, I think that needs to serious rework. Although if you ask me I'd give one advice to everybody, which would be to give your department one shot before deciding that you don't really like whatever you're being taught, life is a bit easier if you start appreciating something niche which your department offers, it could open up some opportunities pretty specific to you. Also an grades in specific courses doesn't give matter at all, just look out for what you getting cumulatively, and don't fail courses. I have a particular ick towards how things are graded at the end of the semester but again that's something you cannot control, so just make fun of it at the end if you get a C in a course you were three times above average. Atleast study till 6th sem if all this is still not enough motivation. Always keep counting your credits though, don't trust Pingala, ask in the DoAA office if you have your doubts about a particular rule regarding how things are counted at IITK.\"), mdx(\"p\", null, \"Hot take time, there are two kinds of people you'll meet here, one associated with the Students' Senate and one who're not, stay away from one of those. With time, I had come to the conclusion that this senate infrastructure, PoRs specifically are so broken here, it doesn't even mean anything significant if you consider my advice above. I mean, I myself have seen a lot, and the best out of those would be being in AUV IITK, and Inter IIT Tech Meets maybe. The thing is, people have started to consider that having a PoR makes them a cut above the rest, its false. I mean, AUV IITK was amazing just because I met super smart people over there, whom I am still in touch with (nag weekly, super amazing seniors lmao), and the kind of crazy responsibilities you feel being over there. The PoR specifically, Team Head, was only fun while voting in the elections, peak polictician moment. Talking about Inter IIT Tech Meets, yes, I have witnessed the downfall, from having to work with super mid leads in the name of PoRs again, to seeing the whole orgainizing team fuck around so bad, they forgot that it was a competition. Although, the problem solving bits during that month is something I would cherish forever, it was surreal what we achieved everytime, given the circumstances. Spilling some tea, the 11th Tech Meet, was such pathetic show of how low IITK has fallen, not as a participating team, but the organizers lmao. There was a dinner out of everything, for networking during a competition, legit witnessed someone keeping their phone in the shirt pockets before coming to talk, just to record something and get some form of dirt on the other teams in the dinner. It was stupid seeing the people orgainizing, go so low doing that, coordinators for the PS having no idea about what to do if a team starts to heckle during someone else's presentation, the judges changing the PS during the presentation, and so much more. It was probably the stupidest I've seen people be during my stay at IITK. Although, absolute love to the participating team, you guys are good, try to be a part of them, it's helpful in the long run. In general, PoRs are good to have if you can make some sense out of those for you, it won't help you get a job though (didn't do it for the Tech Meet organizers xD). I mean it can get you from no job to some job, but not from some job to whatever you're dreaming of for sure if that's the only thing you're basing it on. More on jobs next. Although I am totally of the opinion that this PoR situation will improve over time, used to be good for some clubs, is still good for some, some just need to be shut down.\"), mdx(\"p\", null, \"Jobs and internships next, I think everybody wants a good job here, which makes sense, but in my opinion, that cannot be your sole aim for the 4 years you'd be spending here. No, you don't need to be in Hall 9 to prepare for placements (who even goes to Hall 9, eh), no you don't absolutely need PoRs, SPO could help though, it did for me, although I think I did a bit more for them lol. It is really nice to figure out an intern for your third year summers, I cannot emphazise how much it helps you develop as an individual. Research is something I really wanted to do initially, could not pursure it further though, all I can say is it's good to give it a shot, although what you'd be achieving at the end of it needs to be kept clear. One needs to push hard, in terms of prep, reaching out to people, finding your spot somewhere, to finally get an offer in the end, and that still might not be what you dreamt of but then it's just a part of what you'll do here, don't kill yourself for it. Seniors help only if you know the good ones, don't spam your resume randomly to 30 seniors for review, it might be an absolute disaster.\"), mdx(\"p\", null, \"Explore as much as you can here, I cannot \", mdx(\"em\", {\n    parentName: \"p\"\n  }, \"publicly establish\"), \" how much freedom you have here, try to exploit some, try to own some. I mean I never imagined I would end up managing a 10 year old VM totally on my own and roam around in a hoodie in peak summer just because I was in the server room for 4 hours, even the DDIA is probably still unaware of what the password for that VM is. Similarly, never thought I would witness the kind of craziness I did during my stay in Hall-1, 10/10 recommended. Talking to people, roaming around the campus, finding how broken the internet infrastructure at IITK is, making a blog, travelling during semester breaks, being free to do whatever you feel like are all the things I could never forget. In the end, its your stay, your choice of how you want to remember it, it would be the people for me.\"));\n}\n\n;\nMDXContent.isMDXComponent = true;","renderedOutput":"<p>So, the idea for this is an <a target=\"_blank\" rel=\"noopener noreferrer\" style=\"text-decoration:none\" href=\"https://voxiitk.com/tag/awl/\">AWL</a>; why not put in in Vox? I don&#x27;t know, too bland there. Anyways, reflecting back on whatever time I had at IITK (yeah, excluding the online bit), was pretty crazy, the person who entered this college never thought to be the one leaving now. I will try to broadly describe things you could look forward to here, in a decreasing order of priorities and give my take at those.</p><p>First, IITK has an insanely amazing bunch of people, make sure you find your crowd. Also, CS does this thing with wings, you don&#x27;t really need to stich to them ngl, the day you feel that your parent wing is a bit normie, leave, you&#x27;ll eventually find pepple who you feel are fun to be with (speaking from experience, just don&#x27;t let a past wingie lurk around all the time). No set of rules or instructions though, on whom to hang out with and whom to stay away from, have fun with whatever you like, I feel I should not have a say on that for you. Socialize, don&#x27;t socialize, do whatever you want, just don&#x27;t be alone, I mean, serious skill issue if you cannot find 1 person to bond with in a bunch of 1200 (probably more). Cannot emphazise how important this will be to help you figure out who you want to be. Big time, you are the average the five people you hang out with banger.</p><p>Moving on, academics. Yeah I think it helps a lot if you have a decent academic record. I think anybody would prefer seeing a CPI of 8.4 instead of the reverse on their transcripts. Although I never really understood the things specific to departments and whatever they teach in there, but that&#x27;s a different issue. Talking specifically for Economics I mean the course contents are good, like actually useful, but the way they&#x27;re taught, I think that needs to serious rework. Although if you ask me I&#x27;d give one advice to everybody, which would be to give your department one shot before deciding that you don&#x27;t really like whatever you&#x27;re being taught, life is a bit easier if you start appreciating something niche which your department offers, it could open up some opportunities pretty specific to you. Also an grades in specific courses doesn&#x27;t give matter at all, just look out for what you getting cumulatively, and don&#x27;t fail courses. I have a particular ick towards how things are graded at the end of the semester but again that&#x27;s something you cannot control, so just make fun of it at the end if you get a C in a course you were three times above average. Atleast study till 6th sem if all this is still not enough motivation. Always keep counting your credits though, don&#x27;t trust Pingala, ask in the DoAA office if you have your doubts about a particular rule regarding how things are counted at IITK.</p><p>Hot take time, there are two kinds of people you&#x27;ll meet here, one associated with the Students&#x27; Senate and one who&#x27;re not, stay away from one of those. With time, I had come to the conclusion that this senate infrastructure, PoRs specifically are so broken here, it doesn&#x27;t even mean anything significant if you consider my advice above. I mean, I myself have seen a lot, and the best out of those would be being in AUV IITK, and Inter IIT Tech Meets maybe. The thing is, people have started to consider that having a PoR makes them a cut above the rest, its false. I mean, AUV IITK was amazing just because I met super smart people over there, whom I am still in touch with (nag weekly, super amazing seniors lmao), and the kind of crazy responsibilities you feel being over there. The PoR specifically, Team Head, was only fun while voting in the elections, peak polictician moment. Talking about Inter IIT Tech Meets, yes, I have witnessed the downfall, from having to work with super mid leads in the name of PoRs again, to seeing the whole orgainizing team fuck around so bad, they forgot that it was a competition. Although, the problem solving bits during that month is something I would cherish forever, it was surreal what we achieved everytime, given the circumstances. Spilling some tea, the 11th Tech Meet, was such pathetic show of how low IITK has fallen, not as a participating team, but the organizers lmao. There was a dinner out of everything, for networking during a competition, legit witnessed someone keeping their phone in the shirt pockets before coming to talk, just to record something and get some form of dirt on the other teams in the dinner. It was stupid seeing the people orgainizing, go so low doing that, coordinators for the PS having no idea about what to do if a team starts to heckle during someone else&#x27;s presentation, the judges changing the PS during the presentation, and so much more. It was probably the stupidest I&#x27;ve seen people be during my stay at IITK. Although, absolute love to the participating team, you guys are good, try to be a part of them, it&#x27;s helpful in the long run. In general, PoRs are good to have if you can make some sense out of those for you, it won&#x27;t help you get a job though (didn&#x27;t do it for the Tech Meet organizers xD). I mean it can get you from no job to some job, but not from some job to whatever you&#x27;re dreaming of for sure if that&#x27;s the only thing you&#x27;re basing it on. More on jobs next. Although I am totally of the opinion that this PoR situation will improve over time, used to be good for some clubs, is still good for some, some just need to be shut down.</p><p>Jobs and internships next, I think everybody wants a good job here, which makes sense, but in my opinion, that cannot be your sole aim for the 4 years you&#x27;d be spending here. No, you don&#x27;t need to be in Hall 9 to prepare for placements (who even goes to Hall 9, eh), no you don&#x27;t absolutely need PoRs, SPO could help though, it did for me, although I think I did a bit more for them lol. It is really nice to figure out an intern for your third year summers, I cannot emphazise how much it helps you develop as an individual. Research is something I really wanted to do initially, could not pursure it further though, all I can say is it&#x27;s good to give it a shot, although what you&#x27;d be achieving at the end of it needs to be kept clear. One needs to push hard, in terms of prep, reaching out to people, finding your spot somewhere, to finally get an offer in the end, and that still might not be what you dreamt of but then it&#x27;s just a part of what you&#x27;ll do here, don&#x27;t kill yourself for it. Seniors help only if you know the good ones, don&#x27;t spam your resume randomly to 30 seniors for review, it might be an absolute disaster.</p><p>Explore as much as you can here, I cannot <em>publicly establish</em> how much freedom you have here, try to exploit some, try to own some. I mean I never imagined I would end up managing a 10 year old VM totally on my own and roam around in a hoodie in peak summer just because I was in the server room for 4 hours, even the DDIA is probably still unaware of what the password for that VM is. Similarly, never thought I would witness the kind of craziness I did during my stay in Hall-1, 10/10 recommended. Talking to people, roaming around the campus, finding how broken the internet infrastructure at IITK is, making a blog, travelling during semester breaks, being free to do whatever you feel like are all the things I could never forget. In the end, its your stay, your choice of how you want to remember it, it would be the people for me.</p>","scope":{}},"frontMatter":{"wordCount":1364,"readingTime":{"text":"7 min read","minutes":6.81,"time":408599.99999999994,"words":1362},"slug":"endnotes","fileName":"endnotes.mdx","title":"Endnotes","date":"2024-06-09","tags":["IITK"],"draft":false,"summary":"My take as I leave?","images":[]}},"prev":{"title":"Guide for spending midsem breaks","date":"2024-06-06","tags":["life","travel"],"draft":false,"summary":"A story of all the chaos I created in the past years","images":[],"slug":"guide-for-spending-midsem-breaks"},"next":{"title":"Kubernetes and ROS are surprisingly similar","date":"2025-06-29","tags":["kubernetes","ROS","distributed systems"],"draft":false,"summary":"Why learning ROS made Kubernetes click for me.","images":[],"slug":"ros-and-k8s"}},"__N_SSG":true}