{"pageProps":{"post":{"mdxSource":{"compiledSource":"\"use strict\";\n\nvar _excluded = [\"components\"];\n\nfunction _extends() { _extends = Object.assign || function (target) { for (var i = 1; i < arguments.length; i++) { var source = arguments[i]; for (var key in source) { if (Object.prototype.hasOwnProperty.call(source, key)) { target[key] = source[key]; } } } return target; }; return _extends.apply(this, arguments); }\n\nfunction _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\n\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n\n/* @jsxRuntime classic */\n\n/* @jsx mdx */\nvar layoutProps = {};\nvar MDXLayout = \"wrapper\";\n\nfunction MDXContent(_ref) {\n  var components = _ref.components,\n      props = _objectWithoutProperties(_ref, _excluded);\n\n  return mdx(MDXLayout, _extends({}, layoutProps, props, {\n    components: components,\n    mdxType: \"MDXLayout\"\n  }), mdx(\"p\", null, \"So Harsh recently asked me these questions I'd like to answer through this blog.\"), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"\\\"We ran several security, stress, performance, and scalability tests on the portal\\\" - How? Tools and ideas? just curious on quantifiable analysis of old vs new artitecture design. Also how did you incorporate spike testing? This most probably would be the most important thing to test as when placement season arrives, a lot of users will come.\")), mdx(\"blockquote\", null, mdx(\"p\", {\n    parentName: \"blockquote\"\n  }, \"So, there can are a ton of tools out there which give you reasonable metrics to compare old and new APIs, some of them could be as simple as cURL. Another one is by Grafana called k6, lets you load test and see how the responses come out to be. As for metrics, simple numbers like API Respolution time, number of requests handled per secons, size of the backend image, failover mechanisms, etc. were some things we were particularly curious about. Also it was microservice based so we tried to chunk out all heavy components as separate entities and tested those out. \")), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Why using SQL? \\\"A very neat way to convert an obvious looking NoSQL looking model to a relational one\\\"\")), mdx(\"blockquote\", null, mdx(\"p\", {\n    parentName: \"blockquote\"\n  }, \"SQL simply works. It works faster than you'd expect. Thanks to Harshit for making me realise that. For more details take a look at SQL performance tuning.\")), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Also when the spike comes, how are you tackling the dynamic deadlines in goroutines? Retry mechanisms, buffer times? How did you monitor the chain of calls in the context-based model?\")), mdx(\"blockquote\", null, mdx(\"p\", {\n    parentName: \"blockquote\"\n  }, \"Did not particularly understand what you mean by \\\"dynamic deadlines in goroutines\\\" but yeah we have retry mechanisms for all the services, buffer time, not so much but the lost actions are just rescheduled. For monitoring, we log a lot of actions which helps, although a file based log system sucks tbh. Also there are a few tools to process such file based log, both for golang and nginx so there's that. We also monitor the docker containers log via a web interface.\")), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Can you please breakdown the costs - \\\"This saved us around 30,000 INR per year\\\"\")), mdx(\"blockquote\", null, mdx(\"p\", {\n    parentName: \"blockquote\"\n  }, \"We would've needed S3 otherwise which would've been a recurring cost. It was super simplified to storing it on our machines and keeping a map of some sort (with caching).\")), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"\\\"It is a standard to use all the exposed ports of the backend in the VM first and then proxy the ports on the VM via Nginx\\\" - why is this best practice? just so that the size of docker image reduces!! Your approach seems to be more common sense to me!\")), mdx(\"blockquote\", null, mdx(\"p\", {\n    parentName: \"blockquote\"\n  }, \"Yeah made sense to us to ngl. But communications and real decluttering and a lot of complexities are associated with that. I mean we still fail with a single container failure.\")), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Why implementing custom auth using jwt, why not using auth solutions of nextjs?\")), mdx(\"blockquote\", null, mdx(\"p\", {\n    parentName: \"blockquote\"\n  }, \"Auth solutions are not really that flexible and JWT just makes sense if we're writing a backend for ourselves anyway. Also I am not sure if the Next.js based auth that you mention is totally free.\")), mdx(\"p\", null, \"Finally on endnotes, some of the other real concerns were to maintain queues for emails, cleaning random old OTPs, notification on failure, reverting a lot of database actions (like finding inverse of a function), etc. Some of them has been looked into, hoping that this year's team can also sort a few other issue available \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://github.com/spo-iitk/ras\"\n  }, \"here\"), \" for everyone to view and contribute to. \"));\n}\n\n;\nMDXContent.isMDXComponent = true;","renderedOutput":"<p>So Harsh recently asked me these questions I&#x27;d like to answer through this blog.</p><ul><li>&quot;We ran several security, stress, performance, and scalability tests on the portal&quot; - How? Tools and ideas? just curious on quantifiable analysis of old vs new artitecture design. Also how did you incorporate spike testing? This most probably would be the most important thing to test as when placement season arrives, a lot of users will come.</li></ul><blockquote><p>So, there can are a ton of tools out there which give you reasonable metrics to compare old and new APIs, some of them could be as simple as cURL. Another one is by Grafana called k6, lets you load test and see how the responses come out to be. As for metrics, simple numbers like API Respolution time, number of requests handled per secons, size of the backend image, failover mechanisms, etc. were some things we were particularly curious about. Also it was microservice based so we tried to chunk out all heavy components as separate entities and tested those out. </p></blockquote><ul><li>Why using SQL? &quot;A very neat way to convert an obvious looking NoSQL looking model to a relational one&quot;</li></ul><blockquote><p>SQL simply works. It works faster than you&#x27;d expect. Thanks to Harshit for making me realise that. For more details take a look at SQL performance tuning.</p></blockquote><ul><li>Also when the spike comes, how are you tackling the dynamic deadlines in goroutines? Retry mechanisms, buffer times? How did you monitor the chain of calls in the context-based model?</li></ul><blockquote><p>Did not particularly understand what you mean by &quot;dynamic deadlines in goroutines&quot; but yeah we have retry mechanisms for all the services, buffer time, not so much but the lost actions are just rescheduled. For monitoring, we log a lot of actions which helps, although a file based log system sucks tbh. Also there are a few tools to process such file based log, both for golang and nginx so there&#x27;s that. We also monitor the docker containers log via a web interface.</p></blockquote><ul><li>Can you please breakdown the costs - &quot;This saved us around 30,000 INR per year&quot;</li></ul><blockquote><p>We would&#x27;ve needed S3 otherwise which would&#x27;ve been a recurring cost. It was super simplified to storing it on our machines and keeping a map of some sort (with caching).</p></blockquote><ul><li>&quot;It is a standard to use all the exposed ports of the backend in the VM first and then proxy the ports on the VM via Nginx&quot; - why is this best practice? just so that the size of docker image reduces!! Your approach seems to be more common sense to me!</li></ul><blockquote><p>Yeah made sense to us to ngl. But communications and real decluttering and a lot of complexities are associated with that. I mean we still fail with a single container failure.</p></blockquote><ul><li>Why implementing custom auth using jwt, why not using auth solutions of nextjs?</li></ul><blockquote><p>Auth solutions are not really that flexible and JWT just makes sense if we&#x27;re writing a backend for ourselves anyway. Also I am not sure if the Next.js based auth that you mention is totally free.</p></blockquote><p>Finally on endnotes, some of the other real concerns were to maintain queues for emails, cleaning random old OTPs, notification on failure, reverting a lot of database actions (like finding inverse of a function), etc. Some of them has been looked into, hoping that this year&#x27;s team can also sort a few other issue available <a target=\"_blank\" rel=\"noopener noreferrer\" style=\"text-decoration:none\" href=\"https://github.com/spo-iitk/ras\">here</a> for everyone to view and contribute to. </p>","scope":{}},"frontMatter":{"wordCount":586,"readingTime":{"text":"3 min read","minutes":2.92,"time":175200,"words":584},"slug":"engineering-ras-next-bits","fileName":"engineering-ras-next-bits.mdx","title":"Engineering RAS - Next bits","date":"2023-12-18","tags":["system design","go","product","RAS"],"draft":false,"summary":"Answering some of the questions, and some more thoughts.","images":[]}},"prev":{"title":"Lightweight threads and concurrency","date":"2023-10-14","tags":["go","linux"],"draft":false,"summary":"A bit about what goroutines actually are.","images":[],"slug":"goroutines"},"next":{"title":"How to not build servers","date":"2024-03-02","tags":["backend","go","system-design"],"draft":false,"summary":"Why you should appreciate what already exists before disrupting it.","images":[],"slug":"how-to-not-build-servers"}},"__N_SSG":true}